export const AboutProject = {
  title: 'О проекте:',
  project:
    'Система управления проектами – приложение помогающее достичь поставленные задачи отдельному человеку в команде или группе разработчиков.',
  functionality: {
    title: 'В данном проекты были реализованы:',
    func_1: 'приветственная страница',
    func_2: 'пользовательский логин',
    func_3: 'страница управления проектами',
    func_4: 'страница управления проектом',
    func_5:
      'дополнительный функционал(например, возможность посмотреть все таски выбранного пользователя',
  },
  develop: {
    title: 'Процесс разработки',
    description:
      'В качестве овновного пути развития проекта была выбрана модель GitHub Flow. Для реализации различных требовоний приложения создавлись функциональные ветки, после реализации функционала открывался PR в основную ветку разработки, код проходил ревью от остальных участников команды, что помогало следить за качеством кода и вовремя устранять различного рода ошибки и баги. После ревью, если замечаний нет, происходило слияние рабочей ветки с основной.',
    work: 'Для контроля процесса разработки и соблюдения сроков использовалось Trello, где выделялись основные задачи и сроки их реализации.',
  },
};
export const AboutCourses = {
  title: 'О курсе:',
  promo: 'Онлайн курс «Разработка на React»',
  promo_2: 'Бесплатный курс от сообщества',
  rs: ' The Rolling Scopes.',
  pay_it_forward:
    ' В RS School работает принцип "Pay it forward". Мы бесплатно делимся с учащимися своими знаниями сейчас, надеясь, что в будущем они вернутся к нам в качестве менторов и точно так же передадут свои знания следующему поколению студентов.',
  description:
    ' В RS School может учиться каждый, независимо от возраста, профессиональной занятости и места жительства. Однако для успешного обучения необходимо иметь увереные знания HTML, CSS и Javascript.',
};
